gaoyang3513/GD32W51x_WiFi_IOT/PROT/trusted-firmware-m/platform/ext/target/mps3/an524/device/source/iar/startup_cmsdk_mps3_an524_ns.s
;/*
; * Copyright (c) 2016-2020 ARM Limited
; *
; * Licensed under the Apache License, Version 2.0 (the "License");
; * you may not use this file except in compliance with the License.
; * You may obtain a copy of the License at
; *
; *     http://www.apache.org/licenses/LICENSE-2.0
; *
; * Unless required by applicable law or agreed to in writing, software
; * distributed under the License is distributed on an "AS IS" BASIS,
; * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
; * See the License for the specific language governing permissions and
; * limitations under the License.
; */
;
; This file is derivative of ../armclang/startup_cmsdk_mps2_an521_ns.s

;/*
;//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
;*/


; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

        MODULE   ?cstartup

        ;; Forward declaration of sections.
        SECTION  ARM_LIB_STACK_MSP:DATA:NOROOT(3)
        SECTION  ARM_LIB_STACK:DATA:NOROOT(3)

        SECTION  .intvec:CODE:NOROOT(2)

        EXTERN   __iar_program_start
        EXTERN   SystemInit
        PUBLIC   __vector_table
        PUBLIC   __Vectors
        PUBLIC   __Vectors_End
        PUBLIC   __Vectors_Size

        DATA

__vector_table
        DCD     sfe(ARM_LIB_STACK_MSP)    ; Top of Stack
        DCD     Reset_Handler             ; Reset Handler
        DCD     NMI_Handler               ; NMI Handler
        DCD     HardFault_Handler         ; Hard Fault Handler
        DCD     MemManage_Handler         ; MPU Fault Handler
        DCD     BusFault_Handler          ; Bus Fault Handler
        DCD     UsageFault_Handler        ; Usage Fault Handler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     SVC_Handler               ; SVCall Handler
        DCD     DebugMon_Handler          ; Debug Monitor Handler
        DCD     0                         ; Reserved
        DCD     PendSV_Handler            ; PendSV Handler
        DCD     SysTick_Handler           ; SysTick Handler

        ; Core IoT Interrupts
        DCD     NONSEC_WATCHDOG_RESET_Handler  ; - 0 Non-Secure Watchdog Reset Handler
        DCD     NONSEC_WATCHDOG_Handler        ; - 1 Non-Secure Watchdog Handler
        DCD     S32K_TIMER_Handler             ; - 2 S32K Timer Handler
        DCD     TIMER0_Handler                 ; - 3 TIMER 0 Handler
        DCD     TIMER1_Handler                 ; - 4 TIMER 1 Handler
        DCD     DUALTIMER_Handler              ; - 5 Dual Timer Handler
        DCD     0                              ; Reserved - 6
        DCD     0                              ; Reserved - 7
        DCD     0                              ; Reserved - 8
        DCD     0                              ; Reserved - 9
        DCD     0                              ; Reserved - 10
        DCD     0                              ; Reserved - 11
        DCD     0                              ; Reserved - 12
        DCD     0                              ; Reserved - 13
        DCD     0                              ; Reserved - 14
        DCD     0                              ; Reserved - 15
        DCD     0                              ; Reserved - 16
        DCD     0                              ; Reserved - 17
        DCD     0                              ; Reserved - 18
        DCD     0                              ; Reserved - 19
        DCD     0                              ; Reserved - 20
        DCD     0                              ; Reserved - 21
        DCD     0                              ; Reserved - 22
        DCD     0                              ; Reserved - 23
        DCD     0                              ; Reserved - 24
        DCD     0                              ; Reserved - 25
        DCD     0                              ; Reserved - 26
        DCD     0                              ; Reserved - 27
        DCD     0                              ; Reserved - 28
        DCD     0                              ; Reserved - 29
        DCD     0                              ; Reserved - 30
        DCD     0                              ; Reserved - 31
        ; External Interrupts
        DCD     UARTRX0_Handler           ; 32 UART 0 RX Handler
        DCD     UARTTX0_Handler           ; 33 UART 0 TX Handler
        DCD     UARTRX1_Handler           ; 34 UART 1 RX Handler
        DCD     UARTTX1_Handler           ; 35 UART 1 TX Handler
        DCD     UARTRX2_Handler           ; 36 UART 2 RX Handler
        DCD     UARTTX2_Handler           ; 37 UART 2 TX Handler
        DCD     UARTRX3_Handler           ; 38 UART 3 RX Handler
        DCD     UARTTX3_Handler           ; 39 UART 3 TX Handler
        DCD     UARTRX4_Handler           ; 40 UART 4 RX Handler
        DCD     UARTTX4_Handler           ; 41 UART 4 TX Handler
        DCD     UART0_Handler             ; 42 UART 0 combined Handler
        DCD     UART1_Handler             ; 43 UART 1 combined Handler
        DCD     UART2_Handler             ; 44 UART 2 combined Handler
        DCD     UART3_Handler             ; 45 UART 3 combined Handler
        DCD     UART4_Handler             ; 46 UART 4 combined Handler
        DCD     UARTOVF_Handler           ; 47 UART Overflow Handler
        DCD     ETHERNET_Handler          ; 48 Ethernet Handler
        DCD     I2S_Handler               ; 49 I2S Handler
        DCD     TSC_Handler               ; 50 Touch Screen Handler
        DCD     0                         ; 51 Reserved
        DCD     SPI0_Handler              ; 52 SPI ADC Handler
        DCD     SPI1_Handler              ; 53 SPI (Shield 0) Handler
        DCD     SPI2_Handler              ; 54 SPI (Shield 1) Handler
        DCD     0                         ; 55 Reserved
        DCD     0                         ; 56 Reserved
        DCD     0                         ; 57 Reserved
        DCD     0                         ; 58 Reserved
        DCD     0                         ; 59 Reserved
        DCD     0                         ; 60 Reserved
        DCD     0                         ; 61 Reserved
        DCD     0                         ; 62 Reserved
        DCD     0                         ; 63 Reserved
        DCD     0                         ; 64 Reserved
        DCD     0                         ; 65 Reserved
        DCD     0                         ; 66 Reserved
        DCD     0                         ; 67 Reserved
        DCD     GPIO0_Handler             ; 68 GPIO 0 Comboned Handler
        DCD     GPIO1_Handler             ; 69 GPIO 1 Comboned Handler
        DCD     GPIO2_Handler             ; 70 GPIO 2 Comboned Handler
        DCD     GPIO3_Handler             ; 71 GPIO 3 Comboned Handler
        DCD     GPIO0_0_Handler           ; 72 GPIO0_0 Handler
        DCD     GPIO0_1_Handler           ; 73 GPIO0_1 Handler
        DCD     GPIO0_2_Handler           ; 74 GPIO0_2 Handler
        DCD     GPIO0_3_Handler           ; 75 GPIO0_3 Handler
        DCD     GPIO0_4_Handler           ; 76 GPIO0_4 Handler
        DCD     GPIO0_5_Handler           ; 77 GPIO0_5 Handler
        DCD     GPIO0_6_Handler           ; 78 GPIO0_6 Handler
        DCD     GPIO0_7_Handler           ; 79 GPIO0_7 Handler
        DCD     GPIO0_8_Handler           ; 80 GPIO0_8 Handler
        DCD     GPIO0_9_Handler           ; 81 GPIO0_9 Handler
        DCD     GPIO0_10_Handler          ; 82 GPIO0_10 Handler
        DCD     GPIO0_11_Handler          ; 83 GPIO0_11 Handler
        DCD     GPIO0_12_Handler          ; 84 GPIO0_12 Handler
        DCD     GPIO0_13_Handler          ; 85 GPIO0_13 Handler
        DCD     GPIO0_14_Handler          ; 86 GPIO0_14 Handler
        DCD     GPIO0_15_Handler          ; 87 GPIO0_15 Handler
        DCD     GPIO1_0_Handler           ; 88 GPIO1_0 Handler
        DCD     GPIO1_1_Handler           ; 89 GPIO1_1 Handler
        DCD     GPIO1_2_Handler           ; 90 GPIO1_2 Handler
        DCD     GPIO1_3_Handler           ; 91 GPIO1_3 Handler
        DCD     GPIO1_4_Handler           ; 92 GPIO1_4 Handler
        DCD     GPIO1_5_Handler           ; 93 GPIO1_5 Handler
        DCD     GPIO1_6_Handler           ; 94 GPIO1_6 Handler
        DCD     GPIO1_7_Handler           ; 95 GPIO1_7 Handler
        DCD     GPIO1_8_Handler           ; 96 GPIO1_8 Handler
        DCD     GPIO1_9_Handler           ; 97 GPIO1_0 Handler
        DCD     GPIO1_10_Handler          ; 98 GPIO1_10 Handler
        DCD     GPIO1_11_Handler          ; 99 GPIO1_11 Handler
        DCD     GPIO1_12_Handler          ; 100 GPIO1_12 Handler
        DCD     GPIO1_13_Handler          ; 101 GPIO1_13 Handler
        DCD     GPIO1_14_Handler          ; 102 GPIO1_14 Handler
        DCD     GPIO1_15_Handler          ; 103 GPIO1_15 Handler
        DCD     GPIO2_0_Handler           ; 104 GPIO2_0 Handler
        DCD     GPIO2_1_Handler           ; 105 GPIO2_1 Handler
        DCD     GPIO2_2_Handler           ; 106 GPIO2_2 Handler
        DCD     GPIO2_3_Handler           ; 107 GPIO2_3 Handler
        DCD     GPIO2_4_Handler           ; 108 GPIO2_4 Handler
        DCD     GPIO2_5_Handler           ; 109 GPIO2_5 Handler
        DCD     GPIO2_6_Handler           ; 110 GPIO2_6 Handler
        DCD     GPIO2_7_Handler           ; 111 GPIO2_7 Handler
        DCD     GPIO2_8_Handler           ; 112 GPIO2_8 Handler
        DCD     GPIO2_9_Handler           ; 113 GPIO2_9 Handler
        DCD     GPIO2_10_Handler          ; 114 GPIO2_10 Handler
        DCD     GPIO2_11_Handler          ; 115 GPIO2_11 Handler
        DCD     GPIO2_12_Handler          ; 116 GPIO2_12 Handler
        DCD     GPIO2_13_Handler          ; 117 GPIO2_13 Handler
        DCD     GPIO2_14_Handler          ; 118 GPIO2_14 Handler
        DCD     GPIO2_15_Handler          ; 119 GPIO2_15 Handler
        DCD     GPIO3_0_Handler           ; 120 GPIO2_16 Handler
        DCD     GPIO3_1_Handler           ; 121 GPIO3_0 Handler
        DCD     GPIO3_2_Handler           ; 122 GPIO3_1 Handler
        DCD     GPIO3_3_Handler           ; 123 GPIO3_3 Handler
        DCD     UARTRX5_Handler           ; 124 UART 5 RX Handler
        DCD     UARTTX5_Handler           ; 125 UART 5 TX Handler
        DCD     UART5_Handler             ; 126 UART 5 combined Handler
        DCD     HDLCD_Handler             ; 127 HDCLCD interrupt
__Vectors_End

__Vectors       EQU     __vector_table
__Vectors_Size  EQU     __Vectors_End - __Vectors

